"""
Useful Links:
    Качина типізація - https://www.youtube.com/watch?v=MwsIOSZAkN8
    ABC (Абстрактный базовый класс) -
    Декомпозиція -
    SOLID -
    Single Responsibility -
    Write Better Python Code - https://github.com/ArjanCodes/betterpython
-------------------------------------------

1. Створіть декоратор, який зареєструє клас, що декорується, у списку класів.
"""

# -------------------------------------------

"""
2. Створіть клас декоратора з параметром.
    Параметром має бути рядок, який повинен дописуватись (ліворуч) до результату роботи методу __str__.
"""

# -------------------------------------------

"""
3. Для класу Box напишіть статичний метод, який підраховуватиме сумарний обсяг двох ящиків, які будуть його параметрами.
"""

# -------------------------------------------

"""
4. Створіть дескриптор, який робитиме поля класу керовані ним доступними лише для читання.
"""

# -------------------------------------------

"""
5. Реалізуйте функціонал, який заборонятиме встановлення полів класу будь-якими значеннями, крім цілих чисел.
    Тобто, якщо тому чи іншому полю спробувати присвоїти, наприклад, рядок, то має бути збуджено виняток.
"""

# -------------------------------------------

"""
6. Реалізуйте властивість класу, яка має наступний функціонал:
    - при встановленні значення цієї властивості у файл із заздалегідь певною назвою повинен зберігатися час
        (коли встановлювали значення властивості) та встановлене значення.
"""

# -------------------------------------------

"""
7. Реалізуйте метаклас, який має наступний функціонал: при його використанні у файл із заздалегідь визначеною назвою
    потрібно зберегти ім'я класу та список його полів.
"""

# -------------------------------------------

"""
8. Створіть ABC клас із абстрактним методом перевірки цілого числа на простоту.
    Тобто якщо параметром цього методу є ціле число і воно просте, то метод повинен повернути True,
    а в іншому випадку False.
"""

# -------------------------------------------

"""
9. Створіть його клас наслідуючий.
"""

# -------------------------------------------

"""
10. Створіть клас, який не успадковує ABC клас, але володіє потрібним методом. Зареєструйте його як віртуальний підклас.
"""

# -------------------------------------------

"""
11. Перевірте працездатність проекту.
"""
