"""
Useful Links:
    PEP 257 – Docstring Conventions - https://peps.python.org/pep-0257
    PEP 0 – Index of Python Enhancement Proposals (PEPs) - https://peps.python.org/pep-0000
    Действия с дробями - http://spacemath.xyz/deistviya_s_drobyami
-------------------------------------------

1. Створіть клас «Прямокутник», у якого є два поля (ширина і висота).
    Реалізуйте метод порівняння прямокутників за площею. Також реалізуйте методи складання прямокутників
    (площа сумарного прямокутника повинна дорівнювати сумі площ прямокутників, які ви складаєте).

    Реалізуйте методи множення прямокутника на число n (це має збільшити площу базового прямокутника в n разів).
"""

# -------------------------------------------

"""
2. Створіть клас "Правильна дроба" та реалізуйте методи порівняння, додавання, віднімання та множення для екземплярів
    цього класу.  
"""
