"""
Useful Links:
    regex101: build, test, and debug regex - https://regex101.com
    Regex Generator - https://regex-generator.olafneumann.org/
-------------------------------------------

1. Напишіть регулярний вираз, який знаходитиме в тексті фрагменти, що складаються з однієї літери R,
    за якою слідує одна або більше літер b, за якою одна r. Враховувати верхній та нижній регістр.
"""

# -------------------------------------------

"""
2. Напишіть функцію, яка виконує валідацію номера банківської картки (9999-9999-9999-9999).
"""

# -------------------------------------------

"""
3. Напишіть функцію, яка приймає рядкові дані та виконує перевірку на їхню відповідність E-Mail.
    Вимоги:
        - цифри (0-9).
        - лише латинські літери у великому (A-Z) та малому (a-z) регістрах.
        - у тілі E-Mail допустимі лише символи "_" і "-". Але вони не можуть бути першим символом E-Mail.
        - символ "-" не може повторюватися.
"""

# -------------------------------------------
"""
4. Напишіть функцію, яка перевіряє правильність логіну.
    Правильний логін – рядок від 2 до 10 символів, що містить лише літери та цифри.
"""
