"""
1. Створіть клас, що описує людину (створіть метод, що виводить інформацію про людину).
"""

# -------------------------------------------

"""
2. На його основі створіть клас Студент (перевизначте метод виведення інформації).
"""

# -------------------------------------------

"""
3. Створіть клас Група, який містить масив із 10 об'єктів класу Студент.
    Реалізуйте методи додавання, видалення студента та метод пошуку студента за прізвищем.
    Визначте для Групи метод str() для повернення списку студентів у вигляді рядка.
"""
