"""
1. Створіть декоратор, який підраховуватиме, скільки разів була викликана функція, що декорується.
"""

# -------------------------------------------

"""
2. Створіть декоратор, який зареєструє функцію, що декорується, у списку функцій, для обробки послідовності.
"""

# -------------------------------------------

"""
3. Припустимо, у класі визначено метод __str__, який повертає рядок на підставі класу.
    Створіть такий декоратор для цього методу, щоб отриманий рядок зберігався у текстовий файл, ім'я якого збігається з
    ім'ям класу, метод якого ви декорували.
"""
