"""
Useful Links:
    venv - Creation of virtual environments - https://docs.python.org/3/library/venv.html
    прошу прочитати 9 - 9.4 (включно). - https://docs.python.org/3/tutorial/classes.html
-------------------------------------------
1. Створіть клас для опису товару. У якості атрибутів товару можете використовувати значення ціни товару, опису товару,
    габарити товару. Створіть пару екземплярів вашого класу та протестуйте їхню роботу.
"""

# -------------------------------------------

"""
2. Створіть клас "Покупець".
    У якості атрибутів можна використовувати прізвище, ім'я, по батькові, мобільний телефон тощо.
"""

# -------------------------------------------

"""
3. Створіть клас "Замовлення". Замовлення може містити декілька товарів певної кількості.
    Замовлення має містити дані про користувача, який його здійснив. Реалізуйте метод обчислення сумарної вартості
    замовлення. Визначте метод str() для коректного виведення інформації про це замовлення.
"""
